package com.example.recipes;

import java.util.ArrayList;

public class Recipes_data {

    public static ArrayList<Recipes> getRecipes(){
        ArrayList<Recipes> recipes = new ArrayList<>();

        recipes.add(new Recipes("Oρτύκια κρασάτα", "Κόβουμε τα ορτύκια με ψαλίδι κουζίνας, κατά μήκος της σπονδυλικής στήλης. Αφαιρούμε τη σπονδυλική στήλη.\n" +
                "Μεταφέρουμε σε ένα μπολ τα ορτύκια.\n" +
                "Προσθέτουμε στο μπολ το μισό ελαιόλαδο, το ψιλοκομμένο κρεμμύδι, το ψιλοκομμένο σκόρδο, το θυμάρι, το αλάτι και το πιπέρι.\n" +
                "Ζεσταίνουμε το υπόλοιπο ελαιόλαδο σε μια κατσαρόλα σε μέτρια φωτιά και σοτάρουμε τα ορτύκια μαζί με τα υπόλοιπα υλικά του μπολ για 1-2 λεπτά από κάθε πλευρά μέχρι να ροδίσουν.\n" +
                "Προσθέτουμε τον πελτέ ντομάτας και ανακατεύουμε για 1 λεπτό.\n" +
                "Σβήνουμε με το κρασί και αφήνουμε να εξατμιστεί η μισή ποσότητα.\n" +
                "Προσθέτουμε την ντομάτα κονκασέ και καπακώνουμε.\n" +
                "Σιγοβράζουμε για 15 λεπτά.\n" +
                "Αποσύρουμε την κατσαρόλα από τη φωτιά και σερβίρουμε με πουρέ πατάτας και λίγο φρέσκο θυμάρι.", R.drawable.ortikia_krasata));
        recipes.add(new Recipes("Χοιρινές μπριζόλες με γλυκοπατάτες", "Προθερμαίνουμε τον φούρνο στους 170°C, στον αέρα.\n" +
                "Αλείφουμε ένα ταψί 30x40 εκ. με ελαιόλαδο.\n" +
                "Ανακατεύουμε όλα τα υλικά σε ένα μεγάλο μπολ και τα απλώνουμε ομοιόμορφα στο ταψί.\n" +
                "Ψήνουμε στον προθερμασμένο φούρνο για 40 λεπτά.", R.drawable.xoirines_mprizoles_me_glikopatates));
        recipes.add(new Recipes("Γλυκό ψυγείου με μελισσούλες", "Για τη βάση\n" +
                "\n" +
                "Προθερμαίνουμε τον φούρνο στους 170ο C στον αέρα.\n" +
                "Χτυπάμε στο μίξερ με το σύρμα σε δυνατή ταχύτητα το βούτυρο με τη ζάχαρη, για 3-4 λεπτά, μέχρι να αφρατέψουν καλά.\n" +
                "Χαμηλώνουμε ταχύτητα, ρίχνουμε ένα-ένα τα αυγά και περιμένουμε να ενσωματωθεί το προηγούμενο πριν ρίξουμε το επόμενο.\n" +
                "Προσθέτουμε τη βανίλια και τον χυμό.\n" +
                "Κοσκινίζουμε το αλεύρι, το κακάο, το μπέικιν, το αλάτι και τα ρίχνουμε σε ένα μπολ.\n" +
                "Ρίχνουμε το μείγμα με τα στερεά υλικά σε δόσεις στο μίξερ μέχρι να ομογενοποιηθούν όλα τα υλικά μεταξύ τους. Για να αφρατέψει η βάση θα πρέπει το αλεύρι να ανακατευτεί όσο το δυνατόν λιγότερο.\n" +
                "Βουτυρώνουμε, αλευρώνουμε καλά ένα ταψί 36x28 εκ., και αδειάζουμε το μείγμα.\n" +
                "Ψήνουμε για 35-40 λεπτά.\n" +
                "Αφαιρούμε και αφήνουμε τη βάση να κρυώσει για 10 λεπτά μέσα στο ταψί.\n" +
                "Για την κρέμα\n" +
                "\n" +
                "Βάζουμε σε μια κατσαρόλα 700 γρ. από το γάλα, και το εκχύλισμα βανίλιας.\n" +
                "Προσθέτουμε τη ζάχαρη αλλά δεν ανακατεύουμε. Ανάβουμε το μάτι σε μέτρια φωτιά και ζεσταίνουμε το μείγμα μέχρι να πάρει μια βράση.\n" +
                "Σε ένα μπολ βάζουμε το κορν φλάουρ και τους κρόκους. Προσθέτουμε τα υπόλοιπα 300 γρ. από το γάλα, το ξύσμα λεμονιού, και με ένα σύρμα ανακατεύουμε καλά ώστε να μην κάνει γρομπαλάκια.\n" +
                "Όταν βράσει το γάλα ρίχνουμε σιγά σιγά το μείγμα της κατσαρόλας στο μπολ.\n" +
                "Με ένα σύρμα ανακατεύουμε πολύ καλά. Επιστρέφουμε το μείγμα στην κατσαρόλα και τοποθετούμε σε χαμηλή φωτιά.\n" +
                "Συνεχίζουμε το ανακάτεμα μέχρι να πήξει το μείγμα. Προσπαθούμε να \"ψήσουμε\" την κρέμα ώστε να εξαφανιστεί η γεύση του αλευριού. Αυτή η διαδικασία μπορεί να διαρκέσει και 10 λεπτά μαγειρεύοντας σε χαμηλή φωτιά και ανακατεύοντας συνεχώς.\n" +
                "Αφαιρούμε από τη φωτιά, προσθέτουμε το βούτυρο, το αλάτι και ανακατεύουμε μέχρι να λιώσει το βούτυρο.\n" +
                "Στρώνουμε την κρέμα πάνω στην κρύα βάση.\n" +
                "Καλύπτουμε την κρέμα με μια μεμβράνη που εφάπτεται ώστε να μη δημιουργηθεί πέτσα και βάζουμε το γλυκό στο ψυγείο να παγώσει για 2-3 ώρες.\n" +
                "Για την επικάλυψη\n" +
                "\n" +
                "Σε ένα μπολ βάζουμε τη ζελατίνη, αρκετό κρύο νερό, και τα αφήνουμε να μουλιάσουν για περίπου 5 λεπτά μέχρι να μαλακώσει η ζελατίνη.\n" +
                "Τοποθετούμε ένα κατσαρολάκι σε μέτρια φωτιά προς χαμηλή φωτιά, προσθέτουμε τη μαρμελάδα και ζεσταίνουμε για 2-3 λεπτά. Προσοχή δεν θέλουμε να βράσει!\n" +
                "Αφαιρούμε από τη φωτιά, προσθέτουμε τη ζελατίνη πολύ καλά στυμμένη, το νερό, και ανακατεύουμε με μια ξύλινη κουτάλα μέχρι να λιώσει η ζελατίνη.\n" +
                "Αφήνουμε το μείγμα στην άκρη να κρυώσει για 10 λεπτά, μέχρι να το χρειαστούμε.\n" +
                "Βγάζουμε το ταψί με το γλυκό από το ψυγείο, αφαιρουμε την μεμβρανη, και στρώνουμε από πάνω τη κρύα μαρμελάδα. Ξαναβάζουμε στο ψυγείο για 3-4 ώρες μέχρι να σφίξει η μαρμελάδα.\n" +
                "Σουρώνουμε και σκουπίζουμε καλα τα ροδάκινα. Τα τοποθετούμε πάνω σε μια σχάρα.\n" +
                "Μεταφέρουμε τη λιωμένη κουβερτούρα σε μια σακούλα ζαχαροπλαστικής. Κόβουμε την άκρη της με ένα ψαλίδι ώστε να δημιουργήσουμε μια μικρή τρύπα. Ρίχνουμε τη σοκολάτα σε λωρίδες πάνω από τα ροδάκινα.\n" +
                "Τοποθετούμε 2 καραμέλες ματάκια στο κάθε ροδάκινο αφήνοντας ένα μικρό κενό ανάμεσά τους.\n" +
                "Βάζουμε λίγη σοκολάτα ανάμεσα στα μάτια προκειμένου να δημιουργήσουμε τη μύτη.\n" +
                "Κάνουμε δύο σχισμές πάνω από τα ματάκια και τοποθετούμε τα αμύγδαλα φιλέ.\n" +
                "Απλώνουμε το μείγμα με τη μαρμελάδα πάνω από το γλυκό, κόβουμε το κέικ σε 12 κομμάτια, και τοποθετούμε τα ροδάκινα “μελισσούλες” πάνω από το κάθε κομμάτι.\n" +
                "Σερβίρουμε.", R.drawable.gliko_me_melises));

        return recipes;
    }

}
